In [2]:
import pandas as pd
df = pd.read_csv('C:\\Users\\hp\\Desktop\\data\\covid_toy.csv')

# 1. how big is the data?

In [25]:
df.shape

(100, 6)

# 2. how does the data look like?

In [9]:
df.head() #for starting rows
df.sample(4) #for random rows

    age  gender  fever   cough       city has_covid
9    64  Female  101.0    Mild      Delhi        No
39   50  Female  103.0    Mild    Kolkata        No
12   25  Female   99.0  Strong    Kolkata        No
63   10    Male  100.0    Mild  Bangalore        No

# 3. what is the data tpe of cols

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

# 4. Are there any missing values?

In [23]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

# 5. how does the data look mathemetically?

In [15]:
df.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

# 6. are there duplicate values?

In [21]:
df.duplicated().sum()

1

In [ ]:
df.drop_duplicates()

# 7. how is the correlation between cols?

In [27]:
df.corr() #if we want for particular column then syntax is df.corr()['Column Name']

            age     fever
age    1.000000 -0.017828
fever -0.017828  1.000000